Merge branch 'chore/docs-polish-mermaid-rename' into 'main'
docs: polish, Mermaid diagrams, rename to "Synthetic Raw Data Generator"

See merge request e2es/s2-e2es!8
